# EllipseXParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EllipseXParam Property
ParameterTypeId Class See Also
---
"X-Radius Value for Ellipse (for Use with XAML Data Template example)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EllipseXParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EllipseXParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EllipseXParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace